# 『 インタラクティブモードで遊んでみよう 』


# 【計算してみよう】インタラクティブモード用
1+1
1 + 1 # 空白を入れても上記と同じ
1+2+3+4+5
3*4+1
3*(4+1)
10/3
10//3
10 % 3


# 【Pythonは行頭の空白に意味がある】
# 【文法エラーの時】


# 【命令を実行してみよう】
import calendar
print(calendar.month(2020,1))


# 【ウィンドウも表示できる】未解決
import tkinter
tkinter.Label(None, text="Hello").pack()
# ターミナルでpythonファイルのボタンを押すが、実行結果が教材通りにウィンドウが表示されない
# インタラクティブモードで入力すると、実行結果がちゃんと表示される 

import tkinter
tkinter.Label(None, text="World").pack() 
# ターミナルでpythonファイルのボタンを押すが、実行結果が教材通りにウィンドウが表示されない
# インタラクティブモードで入力すると、実行結果がちゃんと表示される 


# 【命令が分かれば何でもできる】






